Revit 2025 API
MetalPatternType Enumeration
 The enumerated type representing the permitted values for the asset property "MetalPattern" from the "Metal" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum MetalPatternType
Public Enumeration MetalPatternType
public enum class MetalPatternType
type MetalPatternType
Members
Member name | Value | Description
None | 0
Knurl | 1
DiamondPlate | 2
CheckerPlate | 3
Custom | 4
See Also
Reference
Autodesk.Revit.DB.Visual Namespace